import pandas as pd
import pytest


@pytest.fixture
def data_test():
    data = {
        "Дата операции": pd.to_datetime(
            [
                "2021-12-31 16:44:00",
                "2021-12-31 16:42:04",
                "2021-12-31 16:39:04",
                "2021-12-31 15:44:39",
                "2021-12-31 01:23:42",
                "2021-12-31 00:12:53",
                "2021-12-30 22:22:03",
                "2021-12-30 19:18:22",
                "2021-12-30 19:06:39",
                "2021-12-30 17:50:30",
                "2021-12-30 17:50:17",
                "2021-12-30 14:48:25",
                "2021-12-29 22:32:24",
                "2021-12-29 22:28:47",
                "2021-12-30 10:00:00",
                "2021-12-30 12:00:00",
            ]
        ),
        "Сумма операции": [
            -160.89,
            -64.00,
            -118.12,
            -78.05,
            -564.00,
            -800.00,
            -20000.00,
            -7.07,
            -1.32,
            5046.00,
            174000.00,
            -349.00,
            -1411.40,
            -1411.40,
            -500.00,
            -300.00,
        ],
        "Категория": [
            "Супермаркеты",
            "Супермаркеты",
            "Супермаркеты",
            "Супермаркеты",
            "Различные товары",
            "Переводы",
            "Переводы",
            "Каршеринг",
            "Каршеринг",
            "Пополнения",
            "Пополнения",
            "Канцтовары",
            "Ж/д билеты",
            "Ж/д билеты",
            "Супермаркеты",
            "Супермаркеты",
        ],
    }
    return pd.DataFrame(data)
